02-Acoustic-case1/NonLinearAcoustic/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    fixedWalls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          20;
        startFace       11680;
    }
    inlet
    {
        type            patch;
        nFaces          20;
        startFace       11700;
    }
    outlet
    {
        type            patch;
        nFaces          600;
        startFace       11720;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          12000;
        startFace       12320;
    }
)

// ************************************************************************* //
