02-Acoustic-case1/NonLinearAcoustic/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
	fixedWalls
	{
		type	noSlip;
	}

	inlet
	{
		type    pressureInletOutletVelocity;
		value   uniform (0 0 0);
	}

	outlet	
	{
		type 	inletOutlet;
		inletValue	uniform (0 0 0);
		value		uniform (0 0 0);
	}

	
	frontAndBack
	{
		type    empty;
	}
}

// ************************************************************************* //
